In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# criando um dicionario

data = {
    'Pais':['Belgica','India','Brasil'],
    'Capital':['Bruxelas','Nova Delhi','Brasilia'],
    'População':[12345698,9874563,36589754]
}

In [3]:
# criando o DATAFRAME

df = pd.DataFrame(data, columns=['Pais','Capital','População'])

In [4]:
df.head()

      Pais     Capital  População
0  Belgica    Bruxelas   12345698
1    India  Nova Delhi    9874563
2   Brasil    Brasilia   36589754

REMOVENDO COLUNAS E LINHAS

In [5]:
df.drop([0,1])

     Pais   Capital  População
2  Brasil  Brasilia   36589754

In [6]:
# Removendo colunas utilizando o argumento axis=1
df.drop('Pais', axis=1)

      Capital  População
0    Bruxelas   12345698
1  Nova Delhi    9874563
2    Brasilia   36589754

COLETANDO INFORMAÇÕES BASICAS SOBRE O DataFrame

In [7]:
# quantidade de colunas
df.shape

(3, 3)

In [8]:
# Descrição do Index
df.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
# Colunas presentes no DataFrame
df.columns

Index(['Pais', 'Capital', 'População'], dtype='object')

In [10]:
# Contagem de dados Nã0-Nulos
df.count()

Pais         3
Capital      3
População    3
dtype: int64

CRIANDO UMA NOVA COLUNA EM UM DATAFRAME

In [11]:
df['Nova Coluna']=0

In [12]:
df.head()

      Pais     Capital  População  Nova Coluna
0  Belgica    Bruxelas   12345698            0
1    India  Nova Delhi    9874563            0
2   Brasil    Brasilia   36589754            0

RENOMEANDO COLUNAS DE UM DATAFRAME

In [13]:
# Se o seu DataFrame possui 3 colunas , passe 3 novos valores em uma lista 
df.columns = ['coluna 1','coluna 2', 'coluna 3','coluna 4']

In [14]:
df.head()

  coluna 1    coluna 2  coluna 3  coluna 4
0  Belgica    Bruxelas  12345698         0
1    India  Nova Delhi   9874563         0
2   Brasil    Brasilia  36589754         0

RESUMO DOS DADOS

In [15]:
# Soma dos valores de um DataFrame
df.sum()

coluna 1            BelgicaIndiaBrasil
coluna 2    BruxelasNova DelhiBrasilia
coluna 3                      58810015
coluna 4                             0
dtype: object

In [16]:
# Menor valor de um DataFrame
df.min()

coluna 1     Belgica
coluna 2    Brasilia
coluna 3     9874563
coluna 4           0
dtype: object

In [17]:
#Maior Valor
df.max()

coluna 1         India
coluna 2    Nova Delhi
coluna 3      36589754
coluna 4             0
dtype: object

In [19]:
#index do menor valor
df.idmin()

AttributeError: 'DataFrame' object has no attribute 'idmin'

In [21]:
# index maior valor
df.idmax()

AttributeError: 'DataFrame' object has no attribute 'idmax'

In [23]:
#Resumo estatistico do Dataframe, cm quartis, mediana etc
df.describe()

           coluna 3  coluna 4
count  3.000000e+00       3.0
mean   1.960334e+07       0.0
std    1.476246e+07       0.0
min    9.874563e+06       0.0
25%    1.111013e+07       0.0
50%    1.234570e+07       0.0
75%    2.446773e+07       0.0
max    3.658975e+07       0.0

In [24]:
# Media dos valores
df.mean()

coluna 3    1.960334e+07
coluna 4    0.000000e+00
dtype: float64

APLICANDO FUNÇOES

In [25]:
#Aplicando uma funçã oque substitua A por B
df.apply(lambda x: x.replace('a', 'b'))

  coluna 1    coluna 2  coluna 3  coluna 4
0  Belgica    Bruxelas  12345698         0
1    India  Nova Delhi   9874563         0
2   Brasil    Brasilia  36589754         0

ORDENAR VALORES

In [26]:
#Ordenar em ordem crescente
df.sort_values()

TypeError: sort_values() missing 1 required positional argument: 'by'

OPERAÇÕES ARITEMETICAS EM SERIES

In [27]:
s = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])

In [28]:
# Somando todos os valores presentes na Series por 2
s.add(2)

a    3
b    4
c    5
d    6
e    7
dtype: int64

In [29]:
# Subrair 2 de todos os valores
s.sub(2)

a   -1
b    0
c    1
d    2
e    3
dtype: int64

In [30]:
# Multiplcar todos os valores por 2
s.mul(2)

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [31]:
# Dividir Valores por 2
s.div(2)

a    0.5
b    1.0
c    1.5
d    2.0
e    2.5
dtype: float64

Indexação por Boolean:

In [33]:
#Filtrando o DataFrame para mostrar apenas valores pares
df[df['coluna 3'] % 2 == 0]

  coluna 1  coluna 2  coluna 3  coluna 4
0  Belgica  Bruxelas  12345698         0
2   Brasil  Brasilia  36589754         0

SELECIONANDO VALORES

In [34]:
df.loc[0,'coluna 1']

'Belgica'

In [41]:
df.loc[2,'coluna 2']

'Brasilia'